#include <stdio.h>

int main()
{
	printf("饭胶绢 1 ~ 10祈\n");
	printf("(矾快胶 殴佩平殴 饭胶快酒挪摹 练虐荤废 捞巩磊分胶扼俊)\n\n");

	printf("----------------------------------------------------------------------\n\n");


	printf("1祈\n");
	printf("福 客 匙虐胶肺胶(救崇窍技夸)\n");
	printf("饭胶 炼虐客(绊缚嚼聪促)\n");
	printf("夫胶 饭胶 分胶 肺胶(了价钦聪促)\n");
	printf("酒剐府酒胶 坷企府酒(1)\n");
	printf("扼靛快靛 饭靛沫(2)\n");
	printf("浚(3)\n");
	printf("扁(4)\n");
	printf("扼快叼胶 坷府父胶飘饭老捞腊荤(5)\n");
	printf("寇俊叼胶 酒叼胶墨(哭率)\n");
	printf("坷府快弗 客胶虐墨(坷弗率)\n");
	printf("硅饭芳饭 骇芳府酒 骇俊俊 芳饭饭(轨)\n");
	printf("荤府快府鞠(荤恩)\n");
	printf("风咆萍厩(阂)\n");
	printf("饭胶饭胶 肺箭府胶 饭胶饭胶(拱)\n");
	printf("绢扁胶俊绢酒萍扼快荤快绢胶平捞绊埃瘤(瘤备)\n");
	printf("分姐 府魂捞帮(怕剧)\n");
	printf("矾快胶 殴佩平殴 饭胶快酒挪摹 练虐荤废 捞 巩磊分胶扼俊(饭胶绢)\n");
	printf("麻颇沸(笼)\n");
	printf("配飘惩埃捞倔弊(顶)\n");
	printf("荤颇快府 苛飘府酒(矫拌)\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("2祈\n");
	printf("秦歹胶 靛饿 焙胶(赣府)\n");
	printf("呈 沫盟虐客俊具(胶付飘迄)\n");
	printf("盔 胶鸥凭 嫩摹 吭农(哪腔磐)\n");
	printf("饭叼酒胶坷弊扁快荤 扼刮荤沸(芭角)\n");
	printf("挪 模 墨磐风分饭辑(何君)\n");
	printf("夫臂府弊 客稼埃(家)\n");
	printf("辫沥救荤 绊壻荤疯(蹬瘤)\n");
    printf("蹿飘府眶郊(催)\n");
	printf("酒皋泥促府绢饭胶(剧)\n");
	printf("滚弗 廏 弊 滚弊叼胶(帮面)\n");
	printf("窍虐快荤 内府绢胶(茄惫)\n");
	printf("老蜡坷客 荤虐寇具 捞畴葛谋窜(老夯)\n");
	printf("皋客弊福边家 炼惫瘤阿魂废哦(吝惫)\n");
	printf("绢俊矫 林固能飘府绢酒俊何绢谋磐复胶 坷祈府啊饶府(固惫)\n");
	printf("杭复漂稼 櫚矮标己栏俊具(拳己)\n");
	printf("葛弗怕墨磐府 沮 酒胶讽飘 固飘弗(格己)\n");
	printf("配臂府客 唱傈矫墨(配己)\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("3祈\n");
	printf("促皋胶捻(楷鞘)\n");
	printf("瘤荤饯墨捻客平(瘤快俺)\n");
	printf("酒努风荐平(箕橇)\n");
	printf("扁瞒风唱墨欺(杭奇)\n");
	printf("酒浆胶客 凭墨肯磐 哭 刺福掁弗 坷乔府酒(切背)\n");
	printf("风疟练墨客鸥矫 坷拿蜡颇 利默疟(急积丛)\n");
	printf("肺墨虐客固捻唱(切积)\n");
	printf("客挪歹 器殴疟挪 酒蒋府农掁府弊酒颇府酒 橇扼骨恩开(馆厘)\n");
	printf("饭快胶殴佩平 农分掁(惫绢)\n");
	printf("奴 墨客摹挪练客能虐(荐切)\n");
	printf("酒积练墨客 肺档焊肺(荤雀)\n");
	printf("荤捞萍胶内啊刮(苞切)\n");
	printf("雷臂扼 浆 辑 饭殴平农分掁(康绢)\n");
	printf("尼臂饭浆酒(氓惑)\n");
	printf("橇磐腐墨 橇府酒目(狼磊)\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("4祈\n");
	printf("窍儡角 盔力(弧府)\n");
	printf("荤弊府酒 快瓶(酒狐)\n");
	printf("快矫 快瓶(决付)\n");
	printf("焊风虐客 瓶(屈,坷狐)\n");
	printf("恖掁蠢付 啊角 瓶(攫聪,穿唱)\n");
	printf("海弊扼捞固弊府 掁甫固肺(酒扁)\n");
	printf("坷臂恖剐 胶呕睦(末贾)\n");
	printf("唱掁福俊 明分扁(摹距)\n");
	printf("坷府快胶 矫福俊付(澜侥)\n");
	printf("苞臂府快胶(苞磊)\n");
	printf("固萍矫客 'NAME' 虐葛内扼(唱绰 'NAME' 捞具)\n");
	printf("付农府荤 龋快磊墨(父唱辑 馆啊况)\n");
	printf("橇扼捞努 分掓 'FROM' 够酒(唱绰 'FROM' 俊辑 吭绢\n");
	printf("狼矫府胶 'AGE' 捞配府酒(唱绰 'AGE'混 捞具)\n");
	printf("官胶福明佩虐企酒 荤快福叼酒福颇饭聪 滴胶(措烹飞)\n");
	printf("邦狼 割苞 炼混 葫(惫雀狼盔)\n");
	printf("矾快胶 殴佩平殴 饭捞胶墨 配肺固府 轿臂府俊 历歹芭辑 官福胶明矾 付狼付刺 构 跋傲获艰 龋墨瘤付 刺唱扼 芭惫 龋剐饭胶飘氛胶飘捞 瘤阿疟墨 利鸥乔(饭胶刮林林狼牢刮傍拳惫(21))\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("5祈\n");
	printf("老胶(1矫)\n");
	printf("捞胶(2矫)\n");
	printf("伙胶(3矫)\n");
	printf("荤胶(4矫)\n");
	printf("坷胶(5矫)\n");
	printf("腊胶(6矫)\n");
	printf("磨胶(7矫)\n");
	printf("迫胶(8矫)\n");
	printf("备胶(9矫)\n");
	printf("绞胶(10矫)\n");
	printf("绞老胶(11矫)\n");
	printf("绞捞胶(12矫)\n");
	printf("傈 泛胶 叼酒喉坥(坷傈)\n");
	printf("饶 泛胶 叼酒喉坥(坷饶)\n");
	printf("澅舅 挪练(饭胶(挪摹练))\n");
	printf("饭胶饭胶 颇付胶 快恖公狼 能瞒募珝礷酒 徏捞股龋 具快府 斲 阜匡返 凹累(饭胶(荤颇府练))\n");
	printf("坷府胶明扼橇付府俊飘(饭胶(龋困练))\n");
	printf("飘扼捞局臂府快荤(饭胶(嚼拜练))\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("6祈\n");
	printf("磊春快飘(1岿)\n");
	printf("颇橇凤叼(2岿)\n");
	printf("竿摹(3岿)\n");
	printf("狼捞颇凡(4岿)\n");
	printf("跟牢(5岿)\n");
	printf("历聪(6岿)\n");
	printf("例廐聪(7岿)\n");
	printf("酒扁酱飘(8岿)\n");
	printf("火评擴(9岿)\n");
	printf("拦鸥呼(10岿)\n");
	printf("畴过扁(11岿)\n");
	printf("促脚扁(12岿)\n");
	printf("客扁绢(斥)\n");
	printf("酒剐府酒胶 坷飘府酒(老林老)\n");
	printf("扁徃(绢力)\n");
	printf("饶风令(郴老)\n");
	printf("矾扁胶橇(坷疵)\n");
	printf("分灸 牢臂樊荤(崔仿)\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("7祈\n");
	printf("滴农扼捞俊(酒魔)\n");
	printf("鄂农扼捞俊(撤)\n");
	printf("喉傅宏府(广)\n");
	printf("客瞒颇磐 洒飘(货寒)\n");
	printf("且风 概代 暰蜡(官焊)\n");
	printf("贸窍胶平 局明橇明(玫犁)\n");
	printf("备 贬臂贬臂 客掓酒(柯档)\n");
	printf("府玫(mm)\n");
	printf("漠玫(cm)\n");
	printf("玫(m)\n");
	printf("戎玫(km)\n");
	printf("漠赴阑(捍盔)\n");
	printf("矾版扼版 府版风版(版蔓辑)\n");
	printf("颇虐胶肺(家规辑)\n");
	printf("分沥牢(攫力)\n");
	printf("磊胚(恐)\n");
	printf("扁栏刨(亮酒茄促)\n");
	printf("蜡 虐付胶(亮酒窍瘤 臼绰)\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("8祈\n");
	printf("肺变(10盔)\n");
	printf("固肺变(50盔)\n");
	printf("漠肺变(100盔)\n");
	printf("歹肺变(500盔)\n");
	printf("歹漠变(1000盔)\n");
	printf("目府变(5000盔)\n");
	printf("炼腻府变(10000盔)\n");
	printf("目腻府变(50000盔)\n");
	printf("酒顿固福变(100000盔)\n");
	printf("变(盔)\n\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("9祈\n");
	printf("酒 鞘靛 困乃鸥 内胶 酒掁捞扼(俺)\n");
	printf("快明虐 厚明府酒 配扼品快 览 聪 览 览 酒 具 聪纳具(绊剧捞)\n");
	printf("汲品 公家 付烙 唱篮 磷鳖 凉 晳宏府酒(盔件捞)\n");
	printf("雷农 檕 酒 魔撌 绢具 茄单(磅)\n");
	printf("矾矫 快墨 铆唱 窍刺焊 雷农 檕 酒 魔撌 绢具 茄抛(馆崔啊娇磅)\n");
	printf("固初付(裹)\n");
	printf("胶俏毧 兑 栿 鸥鸥 品绢 夫胶夫福 秦具聪快胶 分胶绢矫(倒绊贰)\n");
	printf("酒牢 内扼捞(巨公货)\n");
	printf("挠穖 槉(拱绊扁)\n");
	printf("坷如 次鹿 捞瞒捞嚼 老 氃快 奖瘍老 咯绞盒(坷疵 朝楼绰 ~捞具)\n");

	printf("----------------------------------------------------------------------\n\n");

	printf("10祈\n");
	printf("酒酒酒酒 酒酒酒 酒窍府酒(辆背)\n");
	printf("惯府风胶 呼促唱唱唱囱(沥摹)\n");
	printf("快洒鳖鳖 鹏农鳖(傍魂林狼)\n");
	printf("葛 磊厚 临 鳖 酒拎(磊夯林狼)\n");
	printf("厘窍荤虐 宖 痪扁 癳吺(厘酒赴)\n");
	printf("救崇窍技夸(揪惯)\n");
	printf("赣赣 颇虐明 快明倾府 惯捧(牢己)\n");
	printf("磊葛 荤鞠狼 唱啊 恖快恖窍(荤屈)\n");
	printf("内募 阂鞠狼 柯啊 恖快恖窍(荤屈荐)\n");
	printf("呈公 笼鞠狼 乐啊 内募 阂鞠狼 柯啊 恖快恖窍 稘滚扼 恖快恖窍 荤品 荤府快府酒疟飘(荤屈笼青牢)\n");
	printf("葛 牢 瞒胶 萍 呼 家鳖 瘤 唱 公目 捞 捞 狼 捍毭(巩力)\n");
	printf("复 墨葛内副 橇配妮沸(辑滚)\n");
	printf("复 牢葛内扼 静凉杭沸(努扼捞攫飘)\n");
	printf("窍捞(唱啊)\n");
	printf("せせせせ(げさ)\n");
	printf("ばばばば(涝晨货)\n");
	printf("ぞぞぞぞ(粱厚)\n");
	printf("唱捞 胶付(唱)\n");

	printf("----------------------------------------------------------------------\n\n\n\n\n\n");





	printf("饭胶惯澜 1 ~ 3祈\n");
	printf("(矾快胶 殴佩平殴 饭胶快酒挪摹 练虐荤废 捞巩磊 涝付 胶内扼捞 酒恖)\n\n");

	printf("----------------------------------------------------------------------\n\n");


	printf("1祈\n");
	printf("敖佩(扁开)\n");
	printf("撑稘(聪篮)\n");
	printf("埨稘(叼壁)\n");
	printf("帆稘(府阑)\n");
	printf("感稘(固澜)\n");
	printf("贵稘(厚谰)\n");
	printf("肌佩(矫渴)\n");
	printf("距稘(捞览)\n");
	printf("礼稘(瘤懒)\n");
	printf("猰稘(摹缆)\n");
	printf("慕胚(虐烂)\n");
	printf("禃稘(萍滥)\n");
	printf("期稘(乔琅)\n");
	printf("羍稘(洒榔)\n");

	printf("----------------------------------------------------------------------\n\n");

	return 0;
}